Revit 2027 API
ParameterTypeId.WallSweepPlacementVertical Property
 "Vertical"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallSweepPlacementVertical { get; }
Public Shared ReadOnly Property WallSweepPlacementVertical As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallSweepPlacementVertical {
	ForgeTypeId^ get ();
}
static member WallSweepPlacementVertical : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace